---
kind: method
id: M:Autodesk.Revit.DB.Segment.GetSizes
source: html/9e4a93cb-f0bb-565b-25ee-4aab0a36e4f0.htm
---
# Autodesk.Revit.DB.Segment.GetSizes Method

Gets the defined sizes of the segment.

## Syntax (C#)
```csharp
public ICollection<MEPSize> GetSizes()
```